run/tutorial1_extendedHTC/0/y
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      y;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
100
(
0.005
0.005
0.005
0.005
0.005
0.005
0.005
0.005
...
)
;

boundaryField
{
    movingWall
    {
        type            calculated;
        value           uniform 1e-15;
    }
    left
    {
        type            calculated;
        value           uniform 1e-15;
    }
    right
    {
        type            calculated;
        value           uniform 1e-15;
    }
    bottom
    {
        type            calculated;
        value           uniform 1e-15;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
